In [1]:
%load_ext sql

In [2]:
# %reload_ext sql

In [3]:
%sql postgresql://guest:guest123@127.0.0.1/sparkifydb

'Connected: guest@sparkifydb'

In [4]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://guest:***@127.0.0.1/sparkifydb
5 rows affected.

[(0, datetime.datetime(2018, 11, 16, 0, 0, 57, 796000), '44', 'paid', None, None, 637, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (1, datetime.datetime(2018, 11, 16, 0, 4, 48, 796000), '44', 'paid', None, None, 637, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (3, datetime.datetime(2018, 11, 16, 0, 8, 46, 796000), '44', 'paid', None, None, 637, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (4, datetime.datetime(2018, 11, 16, 0, 11, 51, 796000), '44', 'paid', None, None, 637, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (5, datetime.datetime(2018, 11, 16, 0, 15, 12, 796000), '44', 'paid', None, None, 637, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0')]

In [5]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://guest:***@127.0.0.1/sparkifydb
0 rows affected.

[]

In [6]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://guest:***@127.0.0.1/sparkifydb
1 rows affected.

[('SONYPOM12A8C13B2D7', 'I Think My Wife Is Running Around On Me (Taco Hell)', 'ARDNS031187B9924F0', 2005, 186.48771)]

In [7]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://guest:***@127.0.0.1/sparkifydb
0 rows affected.

[]

In [8]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://guest:***@127.0.0.1/sparkifydb
5 rows affected.

[(796, 0, 1, 1, 1, 1970, 3),
 (796, 0, 1, 1, 1, 1970, 3),
 (796, 0, 1, 1, 1, 1970, 3),
 (796, 0, 1, 1, 1, 1970, 3),
 (796, 0, 1, 1, 1, 1970, 3)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).